api/app/controllers/api/v1/auth_controller.rb

  def create
    begin
      user = User.new(user_params)

      if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "[FILTERED]"], ["encrypted_password", "[FILTERED]"], ["created_at", "2025-02-03 20:08:46.401072"], ["updated_at", "2025-02-03 20:08:46.401072"]]