api/app/controllers/api/v1/expenses_controller.rb

  def index
    @expenses = Expense.all.order(id: :desc)

    expenses_with_images = @expenses.map do |expense|
      expense_attributes = expense.attributes
      expense_attributes['receipt_image_url'] = rails_blob_path(expense.receipt_image, only_path: true) if expense.receipt_image.attached?
      expense_attributes['ticket_image_url'] = rails_blob_path(expense.ticket_image, only_path: true) if expense.ticket_image.attached?
      expense_attributes['tags'] = expense.tags.map { |tag| tag.name }
---
SELECT "expenses".* FROM "expenses" ORDER BY "expenses"."id" DESC
SELECT "tags".* FROM "tags" INNER JOIN "expense_tags" ON "tags"."id" = "expense_tags"."tag_id" WHERE "expense_tags"."expense_id" = $1  [["expense_id", 7]]

  def create
    expense = current_user.expenses.create(expense_params)

    if params[:expense][:tags].present?
      tags = params[:expense][:tags].split(',').map(&:strip).uniq
      tags.each do |tag_name|
        tag = Tag.find_or_create_by(name: tag_name)
        expense.tags << tag
      end
    end

    if expense.save
---
INSERT INTO "expenses" ("user_id", "amount", "description", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "expenses".* FROM "expenses"
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "teste"], ["LIMIT", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "teste"], ["created_at", "2025-02-03 22:23:06.128150"], ["updated_at", "2025-02-03 22:23:06.128150"]]
INSERT INTO "expense_tags" ("expense_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["expense_id", 4], ["tag_id", 1], ["created_at", "2025-02-03 22:24:07.668140"], ["updated_at", "2025-02-03 22:24:07.668140"]]
UPDATE "expenses" SET "updated_at" = $1 WHERE "expenses"."id" = $2  [["updated_at", "2025-02-03 23:23:12.718207"], ["id", 5]]
INSERT INTO "expense_tags" ("expense_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["expense_id", 5], ["tag_id", 1], ["created_at", "2025-02-03 23:23:12.753840"], ["updated_at", "2025-02-03 23:23:12.753840"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "teste 433452"], ["created_at", "2025-02-03 23:23:12.842965"], ["updated_at", "2025-02-03 23:23:12.842965"]]